7767517
227 252
Input            data                     0 1 data -23330=4,3,416,416,3 0=416 1=416 2=3
Convolution      Conv_0                   1 1 data 940 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=648
ReLU             LeakyRelu_1              1 1 940 424 0=1.000000e-01
Pooling          MaxPool_2                1 1 424 425 0=0 1=3 11=3 2=2 12=2 3=1 13=1 14=1 15=1 5=1
Split            splitncnn_0              1 2 425 425_splitncnn_0 425_splitncnn_1
ConvolutionDepthWise Conv_3                   1 1 425_splitncnn_1 943 0=24 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216 7=24
Convolution      Conv_4                   1 1 943 946 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             LeakyRelu_5              1 1 946 430 0=1.000000e-01
Convolution      Conv_6                   1 1 425_splitncnn_0 949 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2112
ReLU             LeakyRelu_7              1 1 949 433 0=1.000000e-01
ConvolutionDepthWise Conv_8                   1 1 433 952 0=88 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=792 7=88
Convolution      Conv_9                   1 1 952 955 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7744
ReLU             LeakyRelu_10             1 1 955 438 0=1.000000e-01
Concat           Concat_11                2 1 430 438 439 0=0
ShuffleChannel   Reshape_16               1 1 439 444 0=2 1=0
Split            splitncnn_1              1 2 444 444_splitncnn_0 444_splitncnn_1
Crop             Slice_27                 1 1 444_splitncnn_1 455 -23309=1,0 -23310=1,88 -23311=1,0
Crop             Slice_30                 1 1 444_splitncnn_0 458 -23309=1,88 -23310=1,176 -23311=1,0
Convolution      Conv_31                  1 1 458 958 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7744
ReLU             LeakyRelu_32             1 1 958 461 0=1.000000e-01
ConvolutionDepthWise Conv_33                  1 1 461 961 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
Convolution      Conv_34                  1 1 961 964 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7744
ReLU             LeakyRelu_35             1 1 964 466 0=1.000000e-01
Concat           Concat_36                2 1 455 466 467 0=0
ShuffleChannel   Reshape_41               1 1 467 472 0=2 1=0
Split            splitncnn_2              1 2 472 472_splitncnn_0 472_splitncnn_1
Crop             Slice_52                 1 1 472_splitncnn_1 483 -23309=1,0 -23310=1,88 -23311=1,0
Crop             Slice_55                 1 1 472_splitncnn_0 486 -23309=1,88 -23310=1,176 -23311=1,0
Convolution      Conv_56                  1 1 486 967 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7744
ReLU             LeakyRelu_57             1 1 967 489 0=1.000000e-01
ConvolutionDepthWise Conv_58                  1 1 489 970 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
Convolution      Conv_59                  1 1 970 973 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7744
ReLU             LeakyRelu_60             1 1 973 494 0=1.000000e-01
Concat           Concat_61                2 1 483 494 495 0=0
ShuffleChannel   Reshape_66               1 1 495 500 0=2 1=0
Split            splitncnn_3              1 2 500 500_splitncnn_0 500_splitncnn_1
Crop             Slice_77                 1 1 500_splitncnn_1 511 -23309=1,0 -23310=1,88 -23311=1,0
Crop             Slice_80                 1 1 500_splitncnn_0 514 -23309=1,88 -23310=1,176 -23311=1,0
Convolution      Conv_81                  1 1 514 976 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7744
ReLU             LeakyRelu_82             1 1 976 517 0=1.000000e-01
ConvolutionDepthWise Conv_83                  1 1 517 979 0=88 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=792 7=88
Convolution      Conv_84                  1 1 979 982 0=88 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=7744
ReLU             LeakyRelu_85             1 1 982 522 0=1.000000e-01
Concat           Concat_86                2 1 511 522 523 0=0
ShuffleChannel   Reshape_91               1 1 523 528 0=2 1=0
Split            splitncnn_4              1 3 528 528_splitncnn_0 528_splitncnn_1 528_splitncnn_2
ConvolutionDepthWise Conv_92                  1 1 528_splitncnn_2 985 0=176 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_93                  1 1 985 988 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_94             1 1 988 533 0=1.000000e-01
Convolution      Conv_95                  1 1 528_splitncnn_1 991 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_96             1 1 991 536 0=1.000000e-01
ConvolutionDepthWise Conv_97                  1 1 536 994 0=176 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_98                  1 1 994 997 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_99             1 1 997 541 0=1.000000e-01
Concat           Concat_100               2 1 533 541 542 0=0
ShuffleChannel   Reshape_105              1 1 542 547 0=2 1=0
Split            splitncnn_5              1 2 547 547_splitncnn_0 547_splitncnn_1
Crop             Slice_116                1 1 547_splitncnn_1 558 -23309=1,0 -23310=1,176 -23311=1,0
Crop             Slice_119                1 1 547_splitncnn_0 561 -23309=1,176 -23310=1,352 -23311=1,0
Convolution      Conv_120                 1 1 561 1000 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_121            1 1 1000 564 0=1.000000e-01
ConvolutionDepthWise Conv_122                 1 1 564 1003 0=176 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_123                 1 1 1003 1006 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_124            1 1 1006 569 0=1.000000e-01
Concat           Concat_125               2 1 558 569 570 0=0
ShuffleChannel   Reshape_130              1 1 570 575 0=2 1=0
Split            splitncnn_6              1 2 575 575_splitncnn_0 575_splitncnn_1
Crop             Slice_141                1 1 575_splitncnn_1 586 -23309=1,0 -23310=1,176 -23311=1,0
Crop             Slice_144                1 1 575_splitncnn_0 589 -23309=1,176 -23310=1,352 -23311=1,0
Convolution      Conv_145                 1 1 589 1009 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_146            1 1 1009 592 0=1.000000e-01
ConvolutionDepthWise Conv_147                 1 1 592 1012 0=176 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_148                 1 1 1012 1015 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_149            1 1 1015 597 0=1.000000e-01
Concat           Concat_150               2 1 586 597 598 0=0
ShuffleChannel   Reshape_155              1 1 598 603 0=2 1=0
Split            splitncnn_7              1 2 603 603_splitncnn_0 603_splitncnn_1
Crop             Slice_166                1 1 603_splitncnn_1 614 -23309=1,0 -23310=1,176 -23311=1,0
Crop             Slice_169                1 1 603_splitncnn_0 617 -23309=1,176 -23310=1,352 -23311=1,0
Convolution      Conv_170                 1 1 617 1018 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_171            1 1 1018 620 0=1.000000e-01
ConvolutionDepthWise Conv_172                 1 1 620 1021 0=176 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_173                 1 1 1021 1024 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_174            1 1 1024 625 0=1.000000e-01
Concat           Concat_175               2 1 614 625 626 0=0
ShuffleChannel   Reshape_180              1 1 626 631 0=2 1=0
Split            splitncnn_8              1 2 631 631_splitncnn_0 631_splitncnn_1
Crop             Slice_191                1 1 631_splitncnn_1 642 -23309=1,0 -23310=1,176 -23311=1,0
Crop             Slice_194                1 1 631_splitncnn_0 645 -23309=1,176 -23310=1,352 -23311=1,0
Convolution      Conv_195                 1 1 645 1027 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_196            1 1 1027 648 0=1.000000e-01
ConvolutionDepthWise Conv_197                 1 1 648 1030 0=176 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_198                 1 1 1030 1033 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_199            1 1 1033 653 0=1.000000e-01
Concat           Concat_200               2 1 642 653 654 0=0
ShuffleChannel   Reshape_205              1 1 654 659 0=2 1=0
Split            splitncnn_9              1 2 659 659_splitncnn_0 659_splitncnn_1
Crop             Slice_216                1 1 659_splitncnn_1 670 -23309=1,0 -23310=1,176 -23311=1,0
Crop             Slice_219                1 1 659_splitncnn_0 673 -23309=1,176 -23310=1,352 -23311=1,0
Convolution      Conv_220                 1 1 673 1036 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_221            1 1 1036 676 0=1.000000e-01
ConvolutionDepthWise Conv_222                 1 1 676 1039 0=176 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_223                 1 1 1039 1042 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_224            1 1 1042 681 0=1.000000e-01
Concat           Concat_225               2 1 670 681 682 0=0
ShuffleChannel   Reshape_230              1 1 682 687 0=2 1=0
Split            splitncnn_10             1 2 687 687_splitncnn_0 687_splitncnn_1
Crop             Slice_241                1 1 687_splitncnn_1 698 -23309=1,0 -23310=1,176 -23311=1,0
Crop             Slice_244                1 1 687_splitncnn_0 701 -23309=1,176 -23310=1,352 -23311=1,0
Convolution      Conv_245                 1 1 701 1045 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_246            1 1 1045 704 0=1.000000e-01
ConvolutionDepthWise Conv_247                 1 1 704 1048 0=176 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_248                 1 1 1048 1051 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_249            1 1 1051 709 0=1.000000e-01
Concat           Concat_250               2 1 698 709 710 0=0
ShuffleChannel   Reshape_255              1 1 710 715 0=2 1=0
Split            splitncnn_11             1 2 715 715_splitncnn_0 715_splitncnn_1
Crop             Slice_266                1 1 715_splitncnn_1 726 -23309=1,0 -23310=1,176 -23311=1,0
Crop             Slice_269                1 1 715_splitncnn_0 729 -23309=1,176 -23310=1,352 -23311=1,0
Convolution      Conv_270                 1 1 729 1054 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_271            1 1 1054 732 0=1.000000e-01
ConvolutionDepthWise Conv_272                 1 1 732 1057 0=176 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1584 7=176
Convolution      Conv_273                 1 1 1057 1060 0=176 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=30976
ReLU             LeakyRelu_274            1 1 1060 737 0=1.000000e-01
Concat           Concat_275               2 1 726 737 738 0=0
ShuffleChannel   Reshape_280              1 1 738 743 0=2 1=0
Split            splitncnn_12             1 3 743 743_splitncnn_0 743_splitncnn_1 743_splitncnn_2
ConvolutionDepthWise Conv_281                 1 1 743_splitncnn_2 1063 0=352 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=3168 7=352
Convolution      Conv_282                 1 1 1063 1066 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_283            1 1 1066 748 0=1.000000e-01
Convolution      Conv_284                 1 1 743_splitncnn_1 1069 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_285            1 1 1069 751 0=1.000000e-01
ConvolutionDepthWise Conv_286                 1 1 751 1072 0=352 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=3168 7=352
Convolution      Conv_287                 1 1 1072 1075 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_288            1 1 1075 756 0=1.000000e-01
Concat           Concat_289               2 1 748 756 757 0=0
ShuffleChannel   Reshape_294              1 1 757 762 0=2 1=0
Split            splitncnn_13             1 2 762 762_splitncnn_0 762_splitncnn_1
Crop             Slice_305                1 1 762_splitncnn_1 773 -23309=1,0 -23310=1,352 -23311=1,0
Crop             Slice_308                1 1 762_splitncnn_0 776 -23309=1,352 -23310=1,704 -23311=1,0
Convolution      Conv_309                 1 1 776 1078 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_310            1 1 1078 779 0=1.000000e-01
ConvolutionDepthWise Conv_311                 1 1 779 1081 0=352 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3168 7=352
Convolution      Conv_312                 1 1 1081 1084 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_313            1 1 1084 784 0=1.000000e-01
Concat           Concat_314               2 1 773 784 785 0=0
ShuffleChannel   Reshape_319              1 1 785 790 0=2 1=0
Split            splitncnn_14             1 2 790 790_splitncnn_0 790_splitncnn_1
Crop             Slice_330                1 1 790_splitncnn_1 801 -23309=1,0 -23310=1,352 -23311=1,0
Crop             Slice_333                1 1 790_splitncnn_0 804 -23309=1,352 -23310=1,704 -23311=1,0
Convolution      Conv_334                 1 1 804 1087 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_335            1 1 1087 807 0=1.000000e-01
ConvolutionDepthWise Conv_336                 1 1 807 1090 0=352 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3168 7=352
Convolution      Conv_337                 1 1 1090 1093 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_338            1 1 1093 812 0=1.000000e-01
Concat           Concat_339               2 1 801 812 813 0=0
ShuffleChannel   Reshape_344              1 1 813 818 0=2 1=0
Split            splitncnn_15             1 2 818 818_splitncnn_0 818_splitncnn_1
Crop             Slice_355                1 1 818_splitncnn_1 829 -23309=1,0 -23310=1,352 -23311=1,0
Crop             Slice_358                1 1 818_splitncnn_0 832 -23309=1,352 -23310=1,704 -23311=1,0
Convolution      Conv_359                 1 1 832 1096 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_360            1 1 1096 835 0=1.000000e-01
ConvolutionDepthWise Conv_361                 1 1 835 1099 0=352 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3168 7=352
Convolution      Conv_362                 1 1 1099 1102 0=352 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=123904
ReLU             LeakyRelu_363            1 1 1102 840 0=1.000000e-01
Concat           Concat_364               2 1 829 840 841 0=0
ShuffleChannel   Reshape_369              1 1 841 846 0=2 1=0
Convolution      Conv_370                 1 1 528_splitncnn_0 847 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=22528
Convolution      Conv_371                 1 1 743_splitncnn_0 848 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=45056
Convolution      Conv_372                 1 1 846 849 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=90112
Split            splitncnn_16             1 2 849 849_splitncnn_0 849_splitncnn_1
Interp           Resize_374               1 1 849_splitncnn_1 854 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
BinaryOp         Add_375                  2 1 848 854 855 0=0
Split            splitncnn_17             1 2 855 855_splitncnn_0 855_splitncnn_1
Interp           Resize_377               1 1 855_splitncnn_1 860 0=2 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
BinaryOp         Add_378                  2 1 847 860 861 0=0
Split            splitncnn_18             1 2 861 861_splitncnn_0 861_splitncnn_1
Interp           Resize_380               1 1 861_splitncnn_1 866 0=2 1=5.000000e-01 2=5.000000e-01 3=0 4=0 6=0
BinaryOp         Add_381                  2 1 855_splitncnn_0 866 867 0=0
Split            splitncnn_19             1 2 867 867_splitncnn_0 867_splitncnn_1
Interp           Resize_383               1 1 867_splitncnn_1 872 0=2 1=5.000000e-01 2=5.000000e-01 3=0 4=0 6=0
BinaryOp         Add_384                  2 1 849_splitncnn_0 872 873 0=0
ConvolutionDepthWise Conv_385                 1 1 861_splitncnn_0 1105 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_386            1 1 1105 876 0=1.000000e-01
Convolution      Conv_387                 1 1 876 1108 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_388            1 1 1108 879 0=1.000000e-01
ConvolutionDepthWise Conv_389                 1 1 879 1111 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_390            1 1 1111 882 0=1.000000e-01
Convolution      Conv_391                 1 1 882 1114 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_392            1 1 1114 885 0=1.000000e-01
Convolution      Conv_393                 1 1 885 886 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14336
Slice            Split_394                1 2 886 887 888 -23300=2,80,-233 1=0
Sigmoid          Sigmoid_395              1 1 887 889
Reshape          Reshape_397              1 1 889 891 0=-1 1=80
Permute          Transpose_398            1 1 891 cls_pred_stride_8 0=1
Reshape          Reshape_400              1 1 888 894 0=-1 1=32
Permute          Transpose_401            1 1 894 dis_pred_stride_8 0=1
ConvolutionDepthWise Conv_402                 1 1 867_splitncnn_0 1117 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_403            1 1 1117 898 0=1.000000e-01
Convolution      Conv_404                 1 1 898 1120 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_405            1 1 1120 901 0=1.000000e-01
ConvolutionDepthWise Conv_406                 1 1 901 1123 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_407            1 1 1123 904 0=1.000000e-01
Convolution      Conv_408                 1 1 904 1126 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_409            1 1 1126 907 0=1.000000e-01
Convolution      Conv_410                 1 1 907 908 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14336
Slice            Split_411                1 2 908 909 910 -23300=2,80,-233 1=0
Sigmoid          Sigmoid_412              1 1 909 911
Reshape          Reshape_414              1 1 911 913 0=-1 1=80
Permute          Transpose_415            1 1 913 cls_pred_stride_16 0=1
Reshape          Reshape_417              1 1 910 916 0=-1 1=32
Permute          Transpose_418            1 1 916 dis_pred_stride_16 0=1
ConvolutionDepthWise Conv_419                 1 1 873 1129 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_420            1 1 1129 920 0=1.000000e-01
Convolution      Conv_421                 1 1 920 1132 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_422            1 1 1132 923 0=1.000000e-01
ConvolutionDepthWise Conv_423                 1 1 923 1135 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_424            1 1 1135 926 0=1.000000e-01
Convolution      Conv_425                 1 1 926 1138 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_426            1 1 1138 929 0=1.000000e-01
Convolution      Conv_427                 1 1 929 930 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14336
Slice            Split_428                1 2 930 931 932 -23300=2,80,-233 1=0
Sigmoid          Sigmoid_429              1 1 931 933
Reshape          Reshape_431              1 1 933 935 0=-1 1=80
Permute          Transpose_432            1 1 935 cls_pred_stride_32 0=1
Reshape          Reshape_434              1 1 932 938 0=-1 1=32
Permute          Transpose_435            1 1 938 dis_pred_stride_32 0=1
